Revit 2027 API
FabricSheet.IsValidHost(Element) Method
 Checks whether an element is a valid host for fabric sheet.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidHost(
	Element host
)
Public Shared Function IsValidHost (
	host As Element
) As Boolean
public:
static bool IsValidHost(
	Element^ host
)
static member IsValidHost :
        host : Element -> bool
Parameters
host Element
 The element to check.
Return Value
Boolean
 True if the element is a valid host for fabric sheet, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FabricSheet Class
IsValidHost Overload
Autodesk.Revit.DB.Structure Namespace